results/iterations/redis_2mb_latency_iter4.txt
====== SET ======
  1000000 requests completed in 11.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 672764)
75.000% <= 0.295 milliseconds (cumulative count 886272)
93.750% <= 0.303 milliseconds (cumulative count 966872)
96.875% <= 0.311 milliseconds (cumulative count 987492)
99.219% <= 0.319 milliseconds (cumulative count 992738)
99.609% <= 0.343 milliseconds (cumulative count 996272)
99.805% <= 0.391 milliseconds (cumulative count 998130)
99.902% <= 0.479 milliseconds (cumulative count 999265)
99.951% <= 0.487 milliseconds (cumulative count 999602)
99.976% <= 0.495 milliseconds (cumulative count 999783)
99.988% <= 0.511 milliseconds (cumulative count 999882)
99.994% <= 0.607 milliseconds (cumulative count 999939)
99.997% <= 0.879 milliseconds (cumulative count 999970)
99.998% <= 0.983 milliseconds (cumulative count 999985)
99.999% <= 1.047 milliseconds (cumulative count 999994)
100.000% <= 1.071 milliseconds (cumulative count 999997)
100.000% <= 1.095 milliseconds (cumulative count 1000000)
100.000% <= 1.095 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 20)
96.687% <= 0.303 milliseconds (cumulative count 966872)
99.833% <= 0.407 milliseconds (cumulative count 998330)
99.985% <= 0.503 milliseconds (cumulative count 999853)
99.994% <= 0.607 milliseconds (cumulative count 999939)
99.995% <= 0.703 milliseconds (cumulative count 999953)
99.996% <= 0.807 milliseconds (cumulative count 999963)
99.997% <= 0.903 milliseconds (cumulative count 999973)
99.999% <= 1.007 milliseconds (cumulative count 999988)
100.000% <= 1.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 90106.33 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.284     0.104     0.287     0.303     0.319     1.095
====== GET ======
  1000000 requests completed in 11.11 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 652768)
75.000% <= 0.295 milliseconds (cumulative count 865334)
87.500% <= 0.303 milliseconds (cumulative count 959452)
96.875% <= 0.311 milliseconds (cumulative count 987193)
99.219% <= 0.319 milliseconds (cumulative count 994307)
99.609% <= 0.327 milliseconds (cumulative count 996517)
99.805% <= 0.343 milliseconds (cumulative count 998176)
99.902% <= 0.471 milliseconds (cumulative count 999085)
99.951% <= 0.487 milliseconds (cumulative count 999712)
99.976% <= 0.495 milliseconds (cumulative count 999880)
99.994% <= 0.511 milliseconds (cumulative count 999954)
99.997% <= 0.543 milliseconds (cumulative count 999970)
99.998% <= 0.599 milliseconds (cumulative count 999994)
100.000% <= 0.607 milliseconds (cumulative count 1000000)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.001% <= 0.207 milliseconds (cumulative count 12)
95.945% <= 0.303 milliseconds (cumulative count 959452)
99.883% <= 0.407 milliseconds (cumulative count 998829)
99.994% <= 0.503 milliseconds (cumulative count 999936)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89976.60 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.284     0.096     0.287     0.303     0.319     0.607