results/iterations/redis_2mb_latency_iter5.txt
====== SET ======
  1000000 requests completed in 11.18 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 2)
50.000% <= 0.287 milliseconds (cumulative count 632249)
75.000% <= 0.295 milliseconds (cumulative count 861741)
87.500% <= 0.303 milliseconds (cumulative count 956868)
96.875% <= 0.311 milliseconds (cumulative count 982317)
98.438% <= 0.319 milliseconds (cumulative count 988617)
99.219% <= 0.343 milliseconds (cumulative count 992714)
99.609% <= 0.479 milliseconds (cumulative count 996344)
99.805% <= 0.551 milliseconds (cumulative count 998209)
99.902% <= 0.591 milliseconds (cumulative count 999199)
99.951% <= 0.615 milliseconds (cumulative count 999602)
99.976% <= 0.639 milliseconds (cumulative count 999810)
99.988% <= 0.671 milliseconds (cumulative count 999878)
99.994% <= 0.743 milliseconds (cumulative count 999940)
99.997% <= 0.863 milliseconds (cumulative count 999970)
99.998% <= 0.943 milliseconds (cumulative count 999986)
99.999% <= 0.991 milliseconds (cumulative count 999994)
100.000% <= 1.023 milliseconds (cumulative count 999997)
100.000% <= 1.047 milliseconds (cumulative count 1000000)
100.000% <= 1.047 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 21)
95.687% <= 0.303 milliseconds (cumulative count 956868)
99.478% <= 0.407 milliseconds (cumulative count 994784)
99.698% <= 0.503 milliseconds (cumulative count 996981)
99.948% <= 0.607 milliseconds (cumulative count 999475)
99.991% <= 0.703 milliseconds (cumulative count 999914)
99.996% <= 0.807 milliseconds (cumulative count 999957)
99.998% <= 0.903 milliseconds (cumulative count 999978)
99.999% <= 1.007 milliseconds (cumulative count 999994)
100.000% <= 1.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89437.44 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.112     0.287     0.303     0.327     1.047
====== GET ======
  1000000 requests completed in 11.18 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 606943)
75.000% <= 0.295 milliseconds (cumulative count 849021)
87.500% <= 0.303 milliseconds (cumulative count 957306)
96.875% <= 0.311 milliseconds (cumulative count 988515)
99.219% <= 0.319 milliseconds (cumulative count 995664)
99.609% <= 0.327 milliseconds (cumulative count 997470)
99.805% <= 0.343 milliseconds (cumulative count 998317)
99.902% <= 0.463 milliseconds (cumulative count 999028)
99.951% <= 0.479 milliseconds (cumulative count 999559)
99.976% <= 0.487 milliseconds (cumulative count 999775)
99.988% <= 0.495 milliseconds (cumulative count 999922)
99.994% <= 0.503 milliseconds (cumulative count 999963)
99.997% <= 0.559 milliseconds (cumulative count 999972)
99.998% <= 0.567 milliseconds (cumulative count 999987)
99.999% <= 0.575 milliseconds (cumulative count 999996)
100.000% <= 0.583 milliseconds (cumulative count 1000000)
100.000% <= 0.583 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 17)
95.731% <= 0.303 milliseconds (cumulative count 957306)
99.879% <= 0.407 milliseconds (cumulative count 998790)
99.996% <= 0.503 milliseconds (cumulative count 999963)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89413.45 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.104     0.287     0.303     0.319     0.583