results/iterations/redis_2mb_latency_iter6.txt
====== SET ======
  1000000 requests completed in 11.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 555143)
75.000% <= 0.295 milliseconds (cumulative count 769263)
87.500% <= 0.311 milliseconds (cumulative count 913569)
93.750% <= 0.319 milliseconds (cumulative count 943638)
96.875% <= 0.335 milliseconds (cumulative count 979067)
98.438% <= 0.343 milliseconds (cumulative count 985838)
99.219% <= 0.367 milliseconds (cumulative count 992977)
99.609% <= 0.415 milliseconds (cumulative count 996296)
99.805% <= 0.471 milliseconds (cumulative count 998242)
99.902% <= 0.495 milliseconds (cumulative count 999156)
99.951% <= 0.527 milliseconds (cumulative count 999607)
99.976% <= 0.543 milliseconds (cumulative count 999764)
99.988% <= 0.591 milliseconds (cumulative count 999891)
99.994% <= 0.639 milliseconds (cumulative count 999942)
99.997% <= 9.351 milliseconds (cumulative count 999970)
99.998% <= 9.599 milliseconds (cumulative count 999985)
99.999% <= 9.751 milliseconds (cumulative count 999993)
100.000% <= 9.839 milliseconds (cumulative count 999997)
100.000% <= 9.903 milliseconds (cumulative count 999999)
100.000% <= 9.927 milliseconds (cumulative count 1000000)
100.000% <= 9.927 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 24)
86.859% <= 0.303 milliseconds (cumulative count 868587)
99.606% <= 0.407 milliseconds (cumulative count 996056)
99.930% <= 0.503 milliseconds (cumulative count 999297)
99.991% <= 0.607 milliseconds (cumulative count 999913)
99.995% <= 0.703 milliseconds (cumulative count 999949)
99.995% <= 0.807 milliseconds (cumulative count 999950)
99.996% <= 9.103 milliseconds (cumulative count 999955)
100.000% <= 10.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88269.04 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.290     0.112     0.287     0.327     0.359     9.927
====== GET ======
  1000000 requests completed in 11.19 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 625780)
75.000% <= 0.295 milliseconds (cumulative count 852400)
87.500% <= 0.303 milliseconds (cumulative count 951166)
96.875% <= 0.311 milliseconds (cumulative count 980832)
98.438% <= 0.319 milliseconds (cumulative count 988921)
99.219% <= 0.335 milliseconds (cumulative count 992608)
99.609% <= 0.407 milliseconds (cumulative count 996196)
99.805% <= 0.495 milliseconds (cumulative count 998172)
99.902% <= 0.551 milliseconds (cumulative count 999181)
99.951% <= 0.567 milliseconds (cumulative count 999681)
99.976% <= 0.575 milliseconds (cumulative count 999868)
99.988% <= 0.583 milliseconds (cumulative count 999945)
99.997% <= 0.591 milliseconds (cumulative count 999972)
99.998% <= 0.599 milliseconds (cumulative count 999989)
99.999% <= 0.615 milliseconds (cumulative count 999994)
100.000% <= 0.639 milliseconds (cumulative count 999997)
100.000% <= 0.687 milliseconds (cumulative count 999999)
100.000% <= 0.703 milliseconds (cumulative count 1000000)
100.000% <= 0.703 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 0.207 milliseconds (cumulative count 14)
95.117% <= 0.303 milliseconds (cumulative count 951166)
99.620% <= 0.407 milliseconds (cumulative count 996196)
99.824% <= 0.503 milliseconds (cumulative count 998244)
99.999% <= 0.607 milliseconds (cumulative count 999990)
100.000% <= 0.703 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89325.59 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.112     0.287     0.303     0.327     0.703